# GetConnectionStatus Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalNodeData..::..GetConnectionStatus Method
AnalyticalNodeData Class See Also
---
Returns the Connection Status for this Analytical Node.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public AnalyticalNodeConnectionStatus GetConnectionStatus()
```

Visual Basic
---
```text
Public Function GetConnectionStatus As AnalyticalNodeConnectionStatus
```

Visual C++
---
```text
public:
AnalyticalNodeConnectionStatus GetConnectionStatus()
```

# See Also
AnalyticalNodeData Class
Autodesk.Revit.DB.Structure Namespace